In [1]:
import numpy as np
import pandas as pd

1. Create 3 list viz. productId, Product Name, Product Price with 5 elements each.
Add this element to create a DataFrame.

In [2]:
df = pd.DataFrame([[101, 'Product A', 10],[102, 'Product B', 20],[103, 'Product C', 15],[104, 'Product D', 80],[105, 'Product E', 120]], index=['A', 'B', 'C', 'D', 'E'], columns=['Product ID', 'Product Name', 'Product Price'])
df

   Product ID Product Name  Product Price
A         101    Product A             10
B         102    Product B             20
C         103    Product C             15
D         104    Product D             80
E         105    Product E            120

Extract one by one column and display separately from above dataframe.

In [3]:
df['Product ID']

A    101
B    102
C    103
D    104
E    105
Name: Product ID, dtype: int64

In [4]:
df['Product Name']

A    Product A
B    Product B
C    Product C
D    Product D
E    Product E
Name: Product Name, dtype: object

In [5]:
df['Product Price']

A     10
B     20
C     15
D     80
E    120
Name: Product Price, dtype: int64

3. Display separately each and every row from an above dataframe. (use loc or iloc function)

In [6]:
df.iloc[[0]]

   Product ID Product Name  Product Price
A         101    Product A             10

In [7]:
df.iloc[[1]]

   Product ID Product Name  Product Price
B         102    Product B             20

In [8]:
df.iloc[[2]]

   Product ID Product Name  Product Price
C         103    Product C             15

In [9]:
df.iloc[[3]]

   Product ID Product Name  Product Price
D         104    Product D             80

In [10]:
df.iloc[[4]]

   Product ID Product Name  Product Price
E         105    Product E            120

4. Display product name from 3 row using loc function.

In [11]:
df.loc['A':'C',['Product Name']]

  Product Name
A    Product A
B    Product B
C    Product C

5. Display price located in 2 row using iloc function.

In [12]:
df.iloc[0:2]['Product Price']

A    10
B    20
Name: Product Price, dtype: int64

6. Display 2nd to 4th row data excluding price.

In [13]:
df.loc['B':'D',df.columns!='Product Price']

   Product ID Product Name
B         102    Product B
C         103    Product C
D         104    Product D

7. Display 1 to 3rd row price data only.

In [14]:
df.loc['A':'C',['Product Price']]

   Product Price
A             10
B             20
C             15

In [15]:
df1=pd.DataFrame(np.random.randint(0,100,(3,3)),index=['Tom','Jack','Will'],columns=['Python','Data Science','DBMS'])
df1

      Python  Data Science  DBMS
Tom       89            13    10
Jack       4            89    90
Will      23            23    40

8. Change marks in python column to 41 for students who have scored less than 40.

In [16]:
df1.loc[df1['Python']<40]=41
df1

      Python  Data Science  DBMS
Tom       89            13    10
Jack      41            41    41
Will      41            41    41

9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100.

In [17]:
df1+2

      Python  Data Science  DBMS
Tom       91            15    12
Jack      43            43    43
Will      43            43    43

10. Display students who have scored more than 50 marks in python and more than 60 marks in data
Science.

In [18]:
df1[(df1['Python'] > 50) & (df1['Data Science'] > 60)]

Empty DataFrame
Columns: [Python, Data Science, DBMS]
Index: []

11. Display students records whose name starts with letter S.

In [19]:
df1.index.str.startswith('S')

array([False, False, False])

12. Display students records whose name ends with letter a.

In [20]:
df1.index.str.endswith('A')

array([False, False, False])

13. Calculate total and percentage for all the students.

In [21]:
df1['total']=df1['Python']+df1['Data Science']+df1['DBMS']
df1

      Python  Data Science  DBMS  total
Tom       89            13    10    112
Jack      41            41    41    123
Will      41            41    41    123

In [22]:
df1['percentage']=df1['total']/3
df1

      Python  Data Science  DBMS  total  percentage
Tom       89            13    10    112   37.333333
Jack      41            41    41    123   41.000000
Will      41            41    41    123   41.000000

14. Calculate Status (PASS / FAIL) for the Students.

In [23]:
df1.loc[df1['percentage']>=50,'status']='pass'
df1.loc[df1['percentage']<50,'status']='fail'
df1

      Python  Data Science  DBMS  total  percentage status
Tom       89            13    10    112   37.333333   fail
Jack      41            41    41    123   41.000000   fail
Will      41            41    41    123   41.000000   fail

15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade,
per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then Fgrade)

In [24]:
df1.loc[df1['percentage']>90,'grade']='A'
df1.loc[df1['percentage']<90,'grade']='B'
df1.loc[df1['percentage']<80,'grade']='C'
df1.loc[df1['percentage']<70,'grade']='D'
df1.loc[df1['percentage']<60,'grade']='E'
df1.loc[df1['percentage']<50,'grade']='F'
df1

      Python  Data Science  DBMS  total  percentage status grade
Tom       89            13    10    112   37.333333   fail     F
Jack      41            41    41    123   41.000000   fail     F
Will      41            41    41    123   41.000000   fail     F

16. Also calculate overall columns total, maximum, minimum and standard deviation for each
numeric columns

In [25]:
df1.describe()

          Python  Data Science       DBMS       total  percentage
count   3.000000      3.000000   3.000000    3.000000    3.000000
mean   57.000000     31.666667  30.666667  119.333333   39.777778
std    27.712813     16.165808  17.897858    6.350853    2.116951
min    41.000000     13.000000  10.000000  112.000000   37.333333
25%    41.000000     27.000000  25.500000  117.500000   39.166667
50%    41.000000     41.000000  41.000000  123.000000   41.000000
75%    65.000000     41.000000  41.000000  123.000000   41.000000
max    89.000000     41.000000  41.000000  123.000000   41.000000

Convert the above dataframe to excel, json and html.

In [26]:
df1.to_excel('student_data.xlsx')
df1.to_json('student_data.json')
df1.to_html('student_data.html')

ModuleNotFoundError: No module named 'openpyxl'

In [ ]:
df.to_excel('product.xlsx')
df.to_json('product.json')
df.to_html('product.html')

17. Display meta-data for each column for the above dataframe.

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Jainil to Purav
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Python        3 non-null      int32
 1   Data Science  3 non-null      int32
 2   DBMS          3 non-null      int32
 3   total         3 non-null      int32
 4   percentage    3 non-null      float64
 5   status        3 non-null      object
 6   grade         3 non-null      object
dtypes: float64(1), int32(4), object(2)
memory usage: 252.0+ bytes

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product ID     5 non-null      int64
 1   Product Name   5 non-null      object
 2   Product Price  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 332.0+ bytes

18.Convert the above DataFrame to list within a dictionary.

In [ ]:
dict=df.to_dict(orient='list')
dict

{'Product ID': [101, 102, 103, 104, 105],
 'Product Name': ['Product A',
  'Product B',
  'Product C',
  'Product D',
  'Product E'],
 'Product Price': [10, 20, 15, 80, 120]}

In [ ]:
dict1=df1.to_dict(orient='list')
dict1

{'Python': [72, 98, 41],
 'Data Science': [38, 96, 41],
 'DBMS': [0, 50, 41],
 'total': [110, 244, 123],
 'percentage': [36.666666666666664, 81.33333333333333, 41.0],
 'status': ['fail', 'pass', 'fail'],
 'grade': ['F', 'B', 'F']}

19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product
price column.

In [ ]:
df2=pd.DataFrame(dict)
df2['Product Price']+=500
df2

   Product ID Product Name  Product Price
0         101    Product A            510
1         102    Product B            520
2         103    Product C            515
3         104    Product D            580
4         105    Product E            620

2. Read Salaries.csv as a dataframe called sal.

In [ ]:
sal = pd.read_csv('Salaries.csv')
sal

C:\Users\HP\AppData\Local\Temp\ipykernel_10748\1798377461.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

3. Check the head of the DataFrame.

In [ ]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

4. Use the .info() method to find out how many entries there are.

In [ ]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

5. What is the average BasePay ?

In [ ]:
sal=sal.replace('Not Provided',np.nan)
sal['BasePay']=sal['BasePay'].astype(float)
sal['BasePay'].mean()

66325.4488404877

6. What is the highest amount of OvertimePay in the dataset ?

In [ ]:
sal=sal.replace('Not Provided',np.nan)
sal['OvertimePay']=sal['OvertimePay'].astype(float)
sal['OvertimePay'].max()

245131.88

7. What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer
that doesn't match up (there is also a lowercase Joseph Driscoll).

In [ ]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

8. How much does JOSEPH DRISCOLL make (including benefits)?

In [ ]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

9. What is the name of highest paid person (including benefits)?

In [ ]:
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

10. What is the name of lowest paid person (including benefits)? Do you notice something strange
about how much he or she is paid?

In [ ]:
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [ ]:
sal['BasePay'] = pd.to_numeric(sal['BasePay'], errors='coerce')
mean_basepay_per_year = sal.groupby('Year')['BasePay'].mean()
mean_basepay_per_year

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

12. How many unique job titles are there?

In [ ]:
sal['JobTitle'].nunique()

2158

13. What are the top 5 most common jobs?

In [ ]:
sal['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only
one occurence in 2013?)

In [ ]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

15. How many people have the word Chief in their job title?

In [ ]:
sal['JobTitle'].str.contains('Chief').sum()

423

16. Is there a correlation between length of the Job Title string and Salary?

In [ ]:
sal['TitleLength'] = sal['JobTitle'].apply(lambda x: len(str(x)) if pd.notnull(x) else 0)
correlation = sal[['TitleLength', 'TotalPayBenefits']].corr()
correlation
#No correlation

                  TitleLength  TotalPayBenefits
TitleLength          1.000000         -0.036809
TotalPayBenefits    -0.036809          1.000000